---
type: WorksharingSaveAsOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# WorksharingSaveAsOptions

`Autodesk.Revit.DB.WorksharingSaveAsOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WorksharingSaveAsOptions | 2014 | `public WorksharingSaveAsOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ClearTransmitted | 2014 | `public bool ClearTransmitted { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OpenWorksetsDefault | 2014 | `public SimpleWorksetConfiguration OpenWorksetsDefault { get ; set ; }` |
| Property | SaveAsCentral | 2014 | `public bool SaveAsCentral { get ; set ; }` |